docs/comp-sci/theorem-provers/mizar/diff-geom.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Differential Geometry - Mizar</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Differential Geometry - Mizar</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-21bd913f-82ca-441e-9aff-8924135f744d">1. Mapping out what has been formalized</a></li>
<li><a href="#h-22dc2629-4ec7-46d6-b094-b8de14a1aa1b">2. Topics Not Yet Formalized</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-21bd913f-82ca-441e-9aff-8924135f744d" class="outline-2">
<h2 id="h-21bd913f-82ca-441e-9aff-8924135f744d"><span class="section-number-2">1.</span> Mapping out what has been formalized</h2>
<div class="outline-text-2" id="text-h-21bd913f-82ca-441e-9aff-8924135f744d">
<p>
There seems to be some work done on topological manifolds, but not much
on differential manifolds. So far, there does not appear to be a notion
of atlases or charts (so far as I can tell, at least).
</p>

<ul class="org-ul">
<li><a href="http://mizar.org/version/current/html/mfold_0.html"><code>mfold_0</code></a> on <a href="http://mizar.org/fm/2014-22/pdf22-2/mfold_0.pdf">topological manifolds</a> is a retcon, retroactively
introducing a notion of a locally Euclidean space which covers
manifolds with and without boundary.</li>
<li><a href="http://mizar.org/version/current/html/mfold_1.html"><code>mfold_1</code></a> formalizes
<a href="http://mizar.org/fm/2011-19/pdf19-1/mfold_1.pdf">the definition of topological manifolds</a> following Jack Lee.
<ul class="org-ul">
<li><a href="http://mizar.org/version/current/html/connsp_2.html"><code>connsp_2</code></a> formalizes notions related to being a neighborhood to a
point in a topological space, which is used when defining the
attribute <code>locally_euclidean</code> (<code>MFOLD_0:def2</code>).</li>
<li><a href="http://mizar.org/version/current/html/mfold_1.html#V2"><code>n-manifold</code></a> is defined as a Hausdorff, second-countable, \(n\)
locally Euclidean space.</li>
</ul></li>
<li><a href="http://mizar.org/version/current/html/mfold_2.html"><code>mfold_2</code></a> formalizes examples of manifolds, namely
<a href="http://mizar.org/fm/2012-20/pdf20-1/mfold_2.pdf">planes, spheres, and stereographic projection</a>.</li>
<li><a href="http://mizar.org/version/current/html/connsp_1.html"><code>connsp_1</code></a> formalizes notions of <a href="http://mizar.org/fm/1990-1/pdf1-1/connsp_1.pdf">connected spaces</a>
<ul class="org-ul">
<li><a href="http://mizar.org/version/current/html/borsuk_2.html#V1"><code>pathwise_connected</code></a> is an attribute defined in
<a href="http://mizar.org/version/current/html/borsuk_2.html#V1"><code>BORSKU_2:Def3</code></a></li>
</ul></li>
<li><a href="http://mizar.org/version/current/html/connsp_3.html"><code>connsp_3</code></a> formalizes notions of <a href="http://mizar.org/fm/1996-5/pdf5-4/connsp_3.pdf">components</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-22dc2629-4ec7-46d6-b094-b8de14a1aa1b" class="outline-2">
<h2 id="h-22dc2629-4ec7-46d6-b094-b8de14a1aa1b"><span class="section-number-2">2.</span> Topics Not Yet Formalized</h2>
<div class="outline-text-2" id="text-h-22dc2629-4ec7-46d6-b094-b8de14a1aa1b">
<p>
However, what is lacking is&#x2026;well, a bit. For example:
</p>

<ul class="org-ul">
<li>Charts and Atlases
<ul class="org-ul">
<li>This is tricky, because there are two conventions for defining a
chart, and they are completely opposite of each other.
<ul class="org-ul">
<li><b>Convention 1:</b> Given a
manifold \(M\) we could define a chart as \(\varphi\colon U\subset M\to\mathbb{R}^{n}\)
being a homeomorphism with its image. The mapping in this direction (from patch of
manifold to Euclidean space) is called the local coordinate for the patch.
<ul class="org-ul">
<li>Bourbaki follows this convention, at least I infer as much from
<i>Lie Groups</i>, III &sect;1.1 Lemma 1
(page 210 of my paperback copy);</li>
<li>Warner's <i>Foundations of Differential Geometry and Lie Groups</i> 
(Def.1.3) follows this convention;</li>
<li>Isham's <i>Modern Differential Geometry for Physicists</i> follows this
convention (Def.2.1 in &sect;2.2).</li>
<li>Spivak's <i>Comprehensive Introduction to Differential Geometry</i>,
vol. I, appears to follow this convention (for every \(x\in M\)
there is a neighborhood \(U\subset M\) of \(x\in U\) which is
homeomorphic to an open subset of \(\mathbb{R}^{n}\) &#x2014; pg 1; but
also see chapter 2, where smooth structures are defined using
charts following this convention)</li>
<li>If I recall correctly, both Tu and Lee follow this convention.</li>
</ul></li>
<li><b>Convention 2:</b> Given a manifold, a chart is a mapping
\(\varphi\colon V\subset\mathbb{R}^{n}\to M\) which is a homeomorphism
with its image. The mapping in this direction (from a patch of
Euclidean space to the manifold) is called a local parametrization
for the manifold.
<ul class="org-ul">
<li>Milnor follows this convention,</li>
<li>do Carmo's <i>Riemannian Geometry</i> uses this convention.</li>
<li>Besse's <i>Einstein Manifolds</i> (&sect;1.41)
appears to have a chart be from a patch of Euclidean space to the
manifold.</li>
<li>When I took Dr Fuchs's
course on differential topology, the convention used followed Milnor
(I suspect to avoid people copying proofs from Tu, Lee, and friends).</li>
</ul></li>
</ul></li>
<li>Compatible charts</li>
<li>Atlas = family of pairwise compatible charts which cover the manifold</li>
<li>Equivalent atlases = the union of the atlases is another atlas</li>
<li>Two atlases are equivalent if and only if every chart from one atlas
is compatible with every chart from the other atlas.</li>
<li>The relation (equivalent atlases) is transitive</li>
<li>A subset of the manifold is open (with respect to an atlas) if blah
blah blah. Atlases induce a topology.</li>
</ul></li>
<li>Mappings between manifolds
<ul class="org-ul">
<li>Embedding, Immersion, Submersion, Diffeomorphism, Local Diffeomorphism</li>
<li>Partitions of Unity</li>
</ul></li>
<li>Products of Manifolds
<ul class="org-ul">
<li>There are other related constructions (the disjoint union of
manifolds of the same dimension, and the connected sum), but I'm not
sure how necessary they are to begin with&#x2026;</li>
</ul></li>
<li>Submanifolds</li>
<li>Tangent Vectors and Vector Fields
<ul class="org-ul">
<li>Tangent bundle, double tangent bundle</li>
</ul></li>
<li>Differentials of Smooth Maps</li>
<li>Morse Theory</li>
<li>Differential Forms</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2022-08-18 Thu 11:53.</p>
</div>
</body>
</html>